module.exports = {
  403: {
    code: 403,
    msg: 'token失效'
  },

  // 100X未知错误
  1001: {
    code: 1001,
    msg: '未知错误'
  },
  1002: {
    code: 1002,
    msg: 'action未知错误'
  },
  // 200X成功类返回，目前只有200
  200: {
    code: 200,
    msg: 'success'
  },
  // 300X，暂时空置
  // 400X和前端交互错误
  4001: {
    code: 4001,
    msg: '参数校验错误'
  },
  4004: {
    code: 4004,
    msg: '接口不存在'
  },
  // 500X，服务错误
  // 600X，数据库错误
  6001: {
    code: 6001,
    msg: '数据库查找失败'
  },
  6002: {
    code: 6002,
    msg: '数据库插入失败'
  },
  6003: {
    code: 6003,
    msg: '数据库更新失败'
  },
  //
  7001: {
    code: 7001,
    msg: '参数错误'
  },
  //
  10000: {
    code: 10000,
    msg: '文件目录不存在'
  },
  // 请求算法接口报错
  8001: {
    code: 8001,
    msg: '请求算法接口报错'
  }
};
